; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image0 - mode
	spectrograph1 - mode
	spectrograph2 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation5 - direction
	Star2 - direction
	Star4 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(pointing satellite1 Phenomenon15)
	(have_image Star11 image0)
	(have_image Planet12 image0)
	(have_image Star13 image0)
	(have_image Planet14 spectrograph1)
	(have_image Phenomenon15 spectrograph2)
	(have_image Star16 spectrograph2)
))

)

; plan
1. (turn_to satellite1 groundstation5 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 8
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite1 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite1 star11 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star11)
   goals met: 0 of 8
5. (take_image satellite1 star11 instrument1 image0)
   added: (have_image star11 image0)
   goals met: 1 of 8
6. (turn_to satellite1 planet14 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet14)
   goals met: 1 of 8
7. (take_image satellite1 planet14 instrument1 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 2 of 8
8. (turn_to satellite1 planet12 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet12)
   goals met: 2 of 8
9. (take_image satellite1 planet12 instrument1 image0)
   added: (have_image planet12 image0)
   goals met: 3 of 8
10. (turn_to satellite0 groundstation5 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation5)
   goals met: 4 of 8
11. (turn_to satellite1 star13 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star13)
   goals met: 4 of 8
12. (take_image satellite1 star13 instrument1 image0)
   added: (have_image star13 image0)
   goals met: 5 of 8
13. (turn_to satellite1 star16 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star16)
   goals met: 5 of 8
14. (take_image satellite1 star16 instrument1 spectrograph2)
   added: (have_image star16 spectrograph2)
   goals met: 6 of 8
15. (turn_to satellite1 phenomenon15 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 phenomenon15)
   goals met: 7 of 8
16. (take_image satellite1 phenomenon15 instrument1 spectrograph2)
   added: (have_image phenomenon15 spectrograph2)
   goals met: 8 of 8
